Revit 2027 API
BuiltInFailures.MultiReferenceAnnotationFailures.ElementCategoryChangeInvalidatesMultiReferenceAnnotation Property
 Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementCategoryChangeInvalidatesMultiReferenceAnnotation { get; }
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesMultiReferenceAnnotation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesMultiReferenceAnnotation {
	FailureDefinitionId^ get ();
}
static member ElementCategoryChangeInvalidatesMultiReferenceAnnotation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MultiReferenceAnnotationFailures Class
Autodesk.Revit.DB Namespace